app/views/users/dashboard.html.erb

<h4> <%=secret.content %> </h4>
<p> Number of likes:<%=secret.likes.count%></p>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = $1  [["secret_id", 27]]