app/controllers/admin_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "secrets".* FROM "secrets" WHERE "secrets"."user_id" = $1  [["user_id", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" IS NULL
---
  def show
    @user = User.find(session[:user_id])
    @user_secrets=Secret.where(user_id:session[:user_id])
    @liked_secrets = Like.where(user:params[:id])