app/controllers/users_controller.rb

  def index
  @user = User.find_by_id(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    user= User.create(name:params[:name], email: params[:email], password:params[:password], password_confirmation:params[:password_confirmation])
---
INSERT INTO "users" ("name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def dashboard
    @secrets=Secret.all
    @user = User.find(session[:user_id])
---
SELECT "secrets".* FROM "secrets"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def secret_create

  secret=Secret.create(content:params[:content], user_id:session[:user_id])
---
INSERT INTO "secrets" ("content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "My secret with user"], ["user_id", 1], ["created_at", 2017-02-23 21:02:52 UTC], ["updated_at", 2017-02-23 21:02:52 UTC]]

  def create_like
      double = Like.where(secret: Secret.find(params[:id]), user: User.find(session[:user_id]))
      if double.empty?
        Like.create(secret: Secret.find(params[:id]), user: User.find(session[:user_id]))
---
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "likes" WHERE "likes"."secret_id" = 27 AND "likes"."user_id" = 2
INSERT INTO "likes" ("user_id", "secret", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["secret", "#<Secret:0x007f92d2936720>"], ["created_at", 2017-02-24 00:36:28 UTC], ["updated_at", 2017-02-24 00:36:28 UTC]]

  def unlike

    Like.where(user:User.find(session[:user_id]), secret:Secret.find(params[:id])).destroy_all
---
DELETE FROM "likes" WHERE "likes"."id" = $1  [["id", 6]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = 2 AND "likes"."secret_id" = 27

  def destroy_dashboard
     Secret.find(params[:id]).destroy
---
DELETE FROM "secrets" WHERE "secrets"."id" = $1  [["id", 17]]
SELECT  "secrets".* FROM "secrets" WHERE "secrets"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]